In [1]:
import config
from DB import Database

In [4]:
import pandas as pd

In [2]:
db = Database()
connection = db.connect()
cursor = connection.cursor()

Init DB...
Connecting to database:
Database connected.
Done!
Connecting to database:
Database connected.

In [5]:
sql = """
SELECT * FROM aapl 
ORDER BY date asc
"""
df = pd.read_sql(sql, con=connection)
df

            date     close     volume      open      high       low
0     2011-04-01   12.3057  417983833   12.5396   12.5567   12.2607
1     2011-04-04   12.1854  459004936   12.2968   12.3071   12.0857
2     2011-04-05   12.1032  482607247   12.0354   12.2232   12.0000
3     2011-04-06   12.0729  401842959   12.1864   12.2821   12.0407
4     2011-04-07   12.0743  373073251   12.0750   12.1582   12.0011
...          ...       ...        ...       ...       ...       ...
2511  2021-03-25  120.5900   98844680  119.5400  121.6600  119.0000
2512  2021-03-26  121.2100   94071230  120.3500  121.4800  118.9200
2513  2021-03-29  121.3900   80819200  121.6500  122.5800  120.7299
2514  2021-03-30  119.9000   85671920  120.1100  120.4031  118.8600
2515  2021-03-31  122.1500  118323800  121.6500  123.5200  121.1500

[2516 rows x 6 columns]

In [ ]:
sql = """
"""